import { Translation } from '../types';

const common: Translation['common'] = {
  loading: "लोड हो रहा है...",
  syncing: "सिंक हो रहा है...",
  lessons: "मॉड्यूल लोड हो रहा है...",
  progress: "प्रगति लोड हो रही है...",
  generating: "अभ्यास पैदा कर रहा है...",
  lesson: "सबक लोड हो रहा है...",
  placement: "मूल्यांकन लोड हो रहा है...",
  pairs: "जोड़े तैयार कर रहा है...",
  tips: [
    "क्या आप जानते हैं? सप्ताह में एक घंटे के बजाय प्रतिदिन 10 मिनट अभ्यास करना बेहतर है।",
    "MichiCoins कमाने और अपनी प्रोफ़ाइल को कस्टमाइज़ करने के लिए पाठ पूरे करें।",
    "इन्फिनिटी मोड आपकी सहनशक्ति के परीक्षण के लिए बेहतरीन है।",
    "यदि आपके जीवन समाप्त हो जाते हैं, तो आप उनके रिचार्ज होने का इंतज़ार कर सकते हैं या अपने MichiCoins का उपयोग कर सकते हैं।",
    "XP बूस्टर सक्रिय रखने के लिए अपनी लकीर (streak) बनाए रखें।",
    "नई भाषा सीखने के लिए निरंतरता ही कुंजी है।",
    "स्टोर से अपने XP बूस्टर का उपयोग करना न भूलें!",
    "सुनने और ज़ोर से दोहराने से आपके उच्चारण में तेज़ी से सुधार होता है।"
  ]
};

export default common;
